{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps(categories(),assignments())/$entity",
    "@odata.type":  "#microsoft.graph.win32LobApp",
    "id":  "44deeec1-fac7-46f6-ae9c-033e81ab1ac9",
    "displayName":  "Remove AppX Packages - User",
    "description":  "Remove AppX Packages - User\n\n",
    "publisher":  "GHS (UK) LTD",
    "largeIcon":  null,
    "createdDateTime":  "2024-11-01T14:33:50.0803966Z",
    "lastModifiedDateTime":  "2024-11-01T15:04:50.6212685Z",
    "isFeatured":  false,
    "privacyInformationUrl":  null,
    "informationUrl":  null,
    "owner":  "",
    "developer":  "",
    "notes":  "",
    "uploadState":  1,
    "publishingState":  "published",
    "isAssigned":  false,
    "roleScopeTagIds":  [
                            "0"
                        ],
    "dependentAppCount":  0,
    "supersedingAppCount":  0,
    "supersededAppCount":  0,
    "committedContentVersion":  "1",
    "fileName":  "removeAppxPackages.intunewin",
    "size":  2528,
    "installCommandLine":  "%SystemRoot%\\SysNative\\WindowsPowerShell\\v1.0\\powershell.exe -NoProfile -ExecutionPolicy ByPass -File .\\removeAppxPackages.ps1",
    "uninstallCommandLine":  "%SystemRoot%\\SysNative\\WindowsPowerShell\\v1.0\\powershell.exe -NoProfile -ExecutionPolicy ByPass -File .\\removeAppxPackages.ps1",
    "applicableArchitectures":  "x86,x64",
    "minimumFreeDiskSpaceInMB":  null,
    "minimumMemoryInMB":  null,
    "minimumNumberOfProcessors":  null,
    "minimumCpuSpeedInMHz":  null,
    "msiInformation":  null,
    "setupFilePath":  "removeAppxPackages.ps1",
    "minimumSupportedWindowsRelease":  "1607",
    "displayVersion":  "2.6",
    "allowAvailableUninstall":  false,
    "minimumSupportedOperatingSystem":  {
                                            "v8_0":  false,
                                            "v8_1":  false,
                                            "v10_0":  false,
                                            "v10_1607":  true,
                                            "v10_1703":  false,
                                            "v10_1709":  false,
                                            "v10_1803":  false,
                                            "v10_1809":  false,
                                            "v10_1903":  false,
                                            "v10_1909":  false,
                                            "v10_2004":  false,
                                            "v10_2H20":  false,
                                            "v10_21H1":  false
                                        },
    "detectionRules":  [
                           {
                               "@odata.type":  "#microsoft.graph.win32LobAppRegistryDetection",
                               "check32BitOn64System":  false,
                               "keyPath":  "HKEY_CURRENT_USER\\Software\\GHS",
                               "valueName":  "setup_removeAppxPackages",
                               "detectionType":  "exists",
                               "operator":  "notConfigured",
                               "detectionValue":  ""
                           }
                       ],
    "requirementRules":  [

                         ],
    "rules":  [
                  {
                      "@odata.type":  "#microsoft.graph.win32LobAppRegistryRule",
                      "ruleType":  "detection",
                      "check32BitOn64System":  false,
                      "keyPath":  "HKEY_CURRENT_USER\\Software\\GHS",
                      "valueName":  "setup_removeAppxPackages",
                      "operationType":  "exists",
                      "operator":  "notConfigured",
                      "comparisonValue":  ""
                  }
              ],
    "installExperience":  {
                              "runAsAccount":  "user",
                              "maxRunTimeInMinutes":  15,
                              "deviceRestartBehavior":  "suppress"
                          },
    "returnCodes":  [
                        {
                            "returnCode":  0,
                            "type":  "success"
                        },
                        {
                            "returnCode":  1707,
                            "type":  "success"
                        },
                        {
                            "returnCode":  3010,
                            "type":  "softReboot"
                        },
                        {
                            "returnCode":  1641,
                            "type":  "hardReboot"
                        },
                        {
                            "returnCode":  1618,
                            "type":  "retry"
                        }
                    ],
    "categories":  [

                   ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps(\u002744deeec1-fac7-46f6-ae9c-033e81ab1ac9\u0027)/microsoft.graph.win32LobApp/assignments"
}
