{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsAutopilotDeploymentProfiles(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
    "@odata.id":  "deviceManagement/windowsAutopilotDeploymentProfiles(\u0027ab3a75c6-ca8c-4208-9b50-a147e91d2340\u0027)",
    "@odata.editLink":  "deviceManagement/windowsAutopilotDeploymentProfiles(\u0027ab3a75c6-ca8c-4208-9b50-a147e91d2340\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile",
    "id":  "ab3a75c6-ca8c-4208-9b50-a147e91d2340",
    "displayName":  "Convert to AutoPilot",
    "description":  "",
    "language":  "en-GB",
    "locale":  "en-GB",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2023-03-14T19:29:18.8357583Z",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2023-03-14T19:29:18.8357583Z",
    "enrollmentStatusScreenSettings":  null,
    "extractHardwareHash":  true,
    "hardwareHashExtractionEnabled":  true,
    "deviceNameTemplate":  "%SERIAL%",
    "deviceType@odata.type":  "#microsoft.graph.windowsAutopilotDeviceType",
    "deviceType":  "windowsPc",
    "enableWhiteGlove":  true,
    "preprovisioningAllowed":  true,
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "managementServiceAppId":  null,
    "outOfBoxExperienceSettings":  {
                                       "@odata.type":  "#microsoft.graph.outOfBoxExperienceSettings",
                                       "hidePrivacySettings":  true,
                                       "hideEULA":  true,
                                       "userType@odata.type":  "#microsoft.graph.windowsUserType",
                                       "userType":  "standard",
                                       "deviceUsageType@odata.type":  "#microsoft.graph.windowsDeviceUsageType",
                                       "deviceUsageType":  "singleUser",
                                       "skipKeyboardSelectionPage":  true,
                                       "hideEscapeLink":  true
                                   },
    "outOfBoxExperienceSetting":  {
                                      "@odata.type":  "#microsoft.graph.outOfBoxExperienceSetting",
                                      "privacySettingsHidden":  true,
                                      "eulaHidden":  true,
                                      "userType@odata.type":  "#microsoft.graph.windowsUserType",
                                      "userType":  "standard",
                                      "deviceUsageType@odata.type":  "#microsoft.graph.windowsDeviceUsageType",
                                      "deviceUsageType":  "singleUser",
                                      "keyboardSelectionPageSkipped":  true,
                                      "escapeLinkHidden":  true
                                  },
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/windowsAutopilotDeploymentProfiles(\u0027ab3a75c6-ca8c-4208-9b50-a147e91d2340\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u0027ab3a75c6-ca8c-4208-9b50-a147e91d2340\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u0027ab3a75c6-ca8c-4208-9b50-a147e91d2340\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignments",
    "assignedDevices@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u0027ab3a75c6-ca8c-4208-9b50-a147e91d2340\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignedDevices/$ref",
    "assignedDevices@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u0027ab3a75c6-ca8c-4208-9b50-a147e91d2340\u0027)/microsoft.graph.azureADWindowsAutopilotDeploymentProfile/assignedDevices",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/windowsAutopilotDeploymentProfiles(\u0027ab3a75c6-ca8c-4208-9b50-a147e91d2340\u0027)/microsoft.graph.windowsAutopilotDeploymentProfile/microsoft.graph.assign"
                                }
}
