[
    {
        "presentationValues":  [
                                   {
                                       "@odata.type":  "#microsoft.graph.groupPolicyPresentationValueText",
                                       "value":  "BiDaily",
                                       "presentation@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions(\u00271f9315ae-99b0-4528-9cc2-2d2102e58bfb\u0027)/presentations(\u0027619a7b84-de29-4928-b52d-6ea27bbfc7df\u0027)",
                                       "#Presentation_Id":  "619a7b84-de29-4928-b52d-6ea27bbfc7df",
                                       "#Presentation_Label":  ""
                                   }
                               ],
        "#Definition_classType":  "machine",
        "#Definition_categoryPath":  "\\Winget-AutoUpdate",
        "enabled":  true,
        "#Definition_Id":  "1f9315ae-99b0-4528-9cc2-2d2102e58bfb",
        "#Definition_displayName":  "Updates Interval",
        "definition@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions(\u00271f9315ae-99b0-4528-9cc2-2d2102e58bfb\u0027)"
    },
    {
        "presentationValues":  [
                                   {
                                       "@odata.type":  "#microsoft.graph.groupPolicyPresentationValueText",
                                       "value":  "Full",
                                       "presentation@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions(\u002752d71400-753d-44f9-be4d-4f23053c75aa\u0027)/presentations(\u0027a5d6feae-4da2-4a81-8ace-3f5f4e830700\u0027)",
                                       "#Presentation_Id":  "a5d6feae-4da2-4a81-8ace-3f5f4e830700",
                                       "#Presentation_Label":  ""
                                   }
                               ],
        "#Definition_classType":  "machine",
        "#Definition_categoryPath":  "\\Winget-AutoUpdate",
        "enabled":  true,
        "#Definition_Id":  "52d71400-753d-44f9-be4d-4f23053c75aa",
        "#Definition_displayName":  "Notification Level",
        "definition@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions(\u002752d71400-753d-44f9-be4d-4f23053c75aa\u0027)"
    },
    {
        "presentationValues":  [
                                   {
                                       "@odata.type":  "#microsoft.graph.groupPolicyPresentationValueText",
                                       "value":  "06:00:00",
                                       "presentation@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions(\u0027317c820f-9e93-4b9d-85d1-6239bfbc9e88\u0027)/presentations(\u0027cc591b81-71b3-4299-b842-379f78094e87\u0027)",
                                       "#Presentation_Id":  "cc591b81-71b3-4299-b842-379f78094e87",
                                       "#Presentation_Label":  ""
                                   }
                               ],
        "#Definition_classType":  "machine",
        "#Definition_categoryPath":  "\\Winget-AutoUpdate",
        "enabled":  true,
        "#Definition_Id":  "317c820f-9e93-4b9d-85d1-6239bfbc9e88",
        "#Definition_displayName":  "Updates at Time",
        "definition@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions(\u0027317c820f-9e93-4b9d-85d1-6239bfbc9e88\u0027)"
    },
    {
        "#Definition_classType":  "machine",
        "#Definition_categoryPath":  "\\Winget-AutoUpdate",
        "enabled":  true,
        "#Definition_Id":  "433eb071-de42-43d6-892a-810089dfc16a",
        "#Definition_displayName":  "Activate WAU GPO Management",
        "definition@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions(\u0027433eb071-de42-43d6-892a-810089dfc16a\u0027)"
    },
    {
        "#Definition_classType":  "machine",
        "#Definition_categoryPath":  "\\Winget-AutoUpdate",
        "enabled":  false,
        "#Definition_Id":  "5172eae2-5112-4970-9d3d-8b7c9a760c38",
        "#Definition_displayName":  "Updates at Logon",
        "definition@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions(\u00275172eae2-5112-4970-9d3d-8b7c9a760c38\u0027)"
    },
    {
        "#Definition_classType":  "machine",
        "#Definition_categoryPath":  "\\Winget-AutoUpdate",
        "enabled":  true,
        "#Definition_Id":  "5d88094f-2001-42f9-be61-ee6ea0e7a17e",
        "#Definition_displayName":  "User context execution",
        "definition@odata.bind":  "https://graph.microsoft.com/beta/deviceManagement/groupPolicyDefinitions(\u00275d88094f-2001-42f9-be61-ee6ea0e7a17e\u0027)"
    }
]
