{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
    "@odata.type":  "#microsoft.graph.conditionalAccessPolicy",
    "@odata.id":  "identity/conditionalAccess/policies(\u002752932eb3-bacf-4d0f-a964-5e4c3949bdf6\u0027)",
    "@odata.editLink":  "identity/conditionalAccess/policies(\u002752932eb3-bacf-4d0f-a964-5e4c3949bdf6\u0027)",
    "id":  "52932eb3-bacf-4d0f-a964-5e4c3949bdf6",
    "templateId":  null,
    "displayName":  "CA000 - All Apps - Block for All Users - Legacy Authentication",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-11-01T19:36:39.6995788Z",
    "modifiedDateTime@odata.type":  "#DateTimeOffset",
    "modifiedDateTime":  "2024-11-04T15:10:57.5969147Z",
    "state@odata.type":  "#microsoft.graph.conditionalAccessPolicyState",
    "state":  "disabled",
    "partialEnablementStrategy":  null,
    "sessionControls":  null,
    "conditions":  {
                       "@odata.type":  "#microsoft.graph.conditionalAccessConditionSet",
                       "userRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes@odata.type":  "#Collection(microsoft.graph.conditionalAccessClientApp)",
                       "clientAppTypes":  [
                                              "exchangeActiveSync",
                                              "other"
                                          ],
                       "platforms":  null,
                       "locations":  null,
                       "times":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "clientApplications":  null,
                       "applications":  {
                                            "@odata.type":  "#microsoft.graph.conditionalAccessApplications",
                                            "includeApplications@odata.type":  "#Collection(String)",
                                            "includeApplications":  [
                                                                        "All"
                                                                    ],
                                            "excludeApplications@odata.type":  "#Collection(String)",
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions@odata.type":  "#Collection(String)",
                                            "includeUserActions":  [

                                                                   ],
                                            "includeAuthenticationContextClassReferences@odata.type":  "#Collection(String)",
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ],
                                            "applicationFilter":  null
                                        },
                       "users":  {
                                     "@odata.type":  "#microsoft.graph.conditionalAccessUsers",
                                     "includeUsers@odata.type":  "#Collection(String)",
                                     "includeUsers":  [
                                                          "All"
                                                      ],
                                     "excludeUsers@odata.type":  "#Collection(String)",
                                     "excludeUsers":  [

                                                      ],
                                     "includeGroups@odata.type":  "#Collection(String)",
                                     "includeGroups":  [

                                                       ],
                                     "excludeGroups@odata.type":  "#Collection(String)",
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles@odata.type":  "#Collection(String)",
                                     "includeRoles":  [

                                                      ],
                                     "excludeRoles@odata.type":  "#Collection(String)",
                                     "excludeRoles":  [

                                                      ],
                                     "includeGuestsOrExternalUsers":  null,
                                     "excludeGuestsOrExternalUsers":  null
                                 }
                   },
    "grantControls":  {
                          "@odata.type":  "#microsoft.graph.conditionalAccessGrantControls",
                          "operator":  "OR",
                          "builtInControls@odata.type":  "#Collection(microsoft.graph.conditionalAccessGrantControl)",
                          "builtInControls":  [
                                                  "block"
                                              ],
                          "customAuthenticationFactors@odata.type":  "#Collection(String)",
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse@odata.type":  "#Collection(String)",
                          "termsOfUse":  [

                                         ],
                          "authenticationStrength@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u002752932eb3-bacf-4d0f-a964-5e4c3949bdf6\u0027)/grantControls/authenticationStrength/$entity",
                          "authenticationStrength@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002752932eb3-bacf-4d0f-a964-5e4c3949bdf6\u0027)/grantControls/authenticationStrength/$ref",
                          "authenticationStrength@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002752932eb3-bacf-4d0f-a964-5e4c3949bdf6\u0027)/grantControls/authenticationStrength",
                          "authenticationStrength":  null
                      }
}
