{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
    "@odata.type":  "#microsoft.graph.conditionalAccessPolicy",
    "@odata.id":  "identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)",
    "@odata.editLink":  "identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)",
    "id":  "76fc8c02-81bb-42bc-911b-5b1d01d3a6b5",
    "templateId":  null,
    "displayName":  "CA501 - All Apps - Strong Authentication - Require Phishing-Resistant MFA for Admin roles",
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-11-01T19:36:48.9004701Z",
    "modifiedDateTime@odata.type":  "#DateTimeOffset",
    "modifiedDateTime":  "2024-11-04T15:18:00.0721707Z",
    "state@odata.type":  "#microsoft.graph.conditionalAccessPolicyState",
    "state":  "disabled",
    "partialEnablementStrategy":  null,
    "sessionControls":  null,
    "conditions":  {
                       "@odata.type":  "#microsoft.graph.conditionalAccessConditionSet",
                       "userRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "userRiskLevels":  [

                                          ],
                       "signInRiskLevels@odata.type":  "#Collection(microsoft.graph.riskLevel)",
                       "signInRiskLevels":  [

                                            ],
                       "clientAppTypes@odata.type":  "#Collection(microsoft.graph.conditionalAccessClientApp)",
                       "clientAppTypes":  [
                                              "all"
                                          ],
                       "platforms":  null,
                       "locations":  null,
                       "times":  null,
                       "deviceStates":  null,
                       "devices":  null,
                       "clientApplications":  null,
                       "applications":  {
                                            "@odata.type":  "#microsoft.graph.conditionalAccessApplications",
                                            "includeApplications@odata.type":  "#Collection(String)",
                                            "includeApplications":  [
                                                                        "All"
                                                                    ],
                                            "excludeApplications@odata.type":  "#Collection(String)",
                                            "excludeApplications":  [

                                                                    ],
                                            "includeUserActions@odata.type":  "#Collection(String)",
                                            "includeUserActions":  [

                                                                   ],
                                            "includeAuthenticationContextClassReferences@odata.type":  "#Collection(String)",
                                            "includeAuthenticationContextClassReferences":  [

                                                                                            ],
                                            "applicationFilter":  null
                                        },
                       "users":  {
                                     "@odata.type":  "#microsoft.graph.conditionalAccessUsers",
                                     "includeUsers@odata.type":  "#Collection(String)",
                                     "includeUsers":  [

                                                      ],
                                     "excludeUsers@odata.type":  "#Collection(String)",
                                     "excludeUsers":  [
                                                          "3fee4944-3d80-4547-9996-9f9332f75b53"
                                                      ],
                                     "includeGroups@odata.type":  "#Collection(String)",
                                     "includeGroups":  [

                                                       ],
                                     "excludeGroups@odata.type":  "#Collection(String)",
                                     "excludeGroups":  [

                                                       ],
                                     "includeRoles@odata.type":  "#Collection(String)",
                                     "includeRoles":  [
                                                          "62e90394-69f5-4237-9190-012177145e10",
                                                          "e8611ab8-c189-46e8-94e1-60213ab1f814",
                                                          "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
                                                          "b0f54661-2d74-4c50-afa3-1ec803f12efe",
                                                          "194ae4cb-b126-40b2-bd5b-6091b380977d",
                                                          "29232cdf-9323-42fd-ade2-1d097af3e4de",
                                                          "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
                                                          "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
                                                          "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
                                                          "fe930be7-5e62-47db-91af-98c3a49a38b1",
                                                          "3a2c62db-5318-420d-8d74-23affee5d9d5",
                                                          "17315797-102d-40b4-93e0-432062caca18",
                                                          "158c047a-c907-4556-b7ef-446551a6b5f7",
                                                          "729827e3-9c14-49f7-bb1b-9608f156bbb8",
                                                          "c4e39bd9-1100-46d3-8c65-fb160da0071f"
                                                      ],
                                     "excludeRoles@odata.type":  "#Collection(String)",
                                     "excludeRoles":  [

                                                      ],
                                     "includeGuestsOrExternalUsers":  null,
                                     "excludeGuestsOrExternalUsers":  null
                                 }
                   },
    "grantControls":  {
                          "@odata.type":  "#microsoft.graph.conditionalAccessGrantControls",
                          "operator":  "OR",
                          "builtInControls@odata.type":  "#Collection(microsoft.graph.conditionalAccessGrantControl)",
                          "builtInControls":  [

                                              ],
                          "customAuthenticationFactors@odata.type":  "#Collection(String)",
                          "customAuthenticationFactors":  [

                                                          ],
                          "termsOfUse@odata.type":  "#Collection(String)",
                          "termsOfUse":  [

                                         ],
                          "authenticationStrength@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength/$entity",
                          "authenticationStrength@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength/$ref",
                          "authenticationStrength@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength",
                          "authenticationStrength":  {
                                                         "@odata.type":  "#microsoft.graph.authenticationStrengthPolicy",
                                                         "@odata.id":  "identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength",
                                                         "@odata.editLink":  "identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength",
                                                         "id":  "00000000-0000-0000-0000-000000000004",
                                                         "createdDateTime@odata.type":  "#DateTimeOffset",
                                                         "createdDateTime":  "2021-12-01T08:00:00Z",
                                                         "modifiedDateTime@odata.type":  "#DateTimeOffset",
                                                         "modifiedDateTime":  "2021-12-01T08:00:00Z",
                                                         "displayName":  "Phishing-resistant MFA",
                                                         "description":  "Phishing-resistant, Passwordless methods for the strongest authentication, such as a FIDO2 security key",
                                                         "policyType@odata.type":  "#microsoft.graph.authenticationStrengthPolicyType",
                                                         "policyType":  "builtIn",
                                                         "requirementsSatisfied@odata.type":  "#microsoft.graph.authenticationStrengthRequirements",
                                                         "requirementsSatisfied":  "mfa",
                                                         "allowedCombinations@odata.type":  "#Collection(microsoft.graph.authenticationMethodModes)",
                                                         "allowedCombinations":  [
                                                                                     "windowsHelloForBusiness",
                                                                                     "fido2",
                                                                                     "x509CertificateMultiFactor"
                                                                                 ],
                                                         "combinationConfigurations@odata.context":  "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength/combinationConfigurations",
                                                         "combinationConfigurations@odata.associationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength/combinationConfigurations/$ref",
                                                         "combinationConfigurations@odata.navigationLink":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength/combinationConfigurations",
                                                         "combinationConfigurations":  [

                                                                                       ],
                                                         "#microsoft.graph.updateAllowedCombinations":  {
                                                                                                            "title":  "microsoft.graph.updateAllowedCombinations",
                                                                                                            "target":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength/microsoft.graph.updateAllowedCombinations"
                                                                                                        },
                                                         "#microsoft.graph.usage":  {
                                                                                        "title":  "microsoft.graph.usage",
                                                                                        "target":  "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u002776fc8c02-81bb-42bc-911b-5b1d01d3a6b5\u0027)/grantControls/authenticationStrength/microsoft.graph.usage"
                                                                                    }
                                                     }
                      }
}
