{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration",
    "id":  "fe19c4c8-6dbe-4042-ab97-8afd847b7d2d",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-11-01T14:12:03.5827021Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-11-01T14:07:06.7429829Z",
    "description":  "",
    "displayName":  "Android Personal - GHS - TP - Device Restrictions - D - Work Profile",
    "version":  4,
    "passwordBlockFaceUnlock":  false,
    "passwordBlockFingerprintUnlock":  false,
    "passwordBlockIrisUnlock":  false,
    "passwordBlockTrustAgents":  false,
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  null,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  null,
    "passwordPreviousPasswordBlockCount":  null,
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "passwordRequiredType@odata.type":  "#microsoft.graph.androidWorkProfileRequiredPasswordType",
    "passwordRequiredType":  "atLeastNumeric",
    "requiredPasswordComplexity@odata.type":  "#microsoft.graph.androidRequiredPasswordComplexity",
    "requiredPasswordComplexity":  "none",
    "workProfileAllowAppInstallsFromUnknownSources":  false,
    "workProfileDataSharingType@odata.type":  "#microsoft.graph.androidWorkProfileCrossProfileDataSharingType",
    "workProfileDataSharingType":  "allowPersonalToWork",
    "workProfileBlockNotificationsWhileDeviceLocked":  false,
    "workProfileBlockAddingAccounts":  false,
    "workProfileBluetoothEnableContactSharing":  false,
    "workProfileBlockScreenCapture":  false,
    "workProfileBlockCrossProfileCallerId":  false,
    "workProfileBlockCamera":  false,
    "workProfileBlockCrossProfileContactsSearch":  false,
    "workProfileBlockCrossProfileCopyPaste":  true,
    "workProfileDefaultAppPermissionPolicy@odata.type":  "#microsoft.graph.androidWorkProfileDefaultAppPermissionPolicyType",
    "workProfileDefaultAppPermissionPolicy":  "deviceDefault",
    "workProfilePasswordBlockFaceUnlock":  false,
    "workProfilePasswordBlockFingerprintUnlock":  false,
    "workProfilePasswordBlockIrisUnlock":  false,
    "workProfilePasswordBlockTrustAgents":  false,
    "workProfilePasswordExpirationDays":  null,
    "workProfilePasswordMinimumLength":  6,
    "workProfilePasswordMinNumericCharacters":  null,
    "workProfilePasswordMinNonLetterCharacters":  null,
    "workProfilePasswordMinLetterCharacters":  null,
    "workProfilePasswordMinLowerCaseCharacters":  null,
    "workProfilePasswordMinUpperCaseCharacters":  null,
    "workProfilePasswordMinSymbolCharacters":  null,
    "workProfilePasswordMinutesOfInactivityBeforeScreenTimeout":  null,
    "workProfilePasswordPreviousPasswordBlockCount":  null,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset":  10,
    "workProfilePasswordRequiredType@odata.type":  "#microsoft.graph.androidWorkProfileRequiredPasswordType",
    "workProfilePasswordRequiredType":  "atLeastNumeric",
    "workProfileRequiredPasswordComplexity@odata.type":  "#microsoft.graph.androidRequiredPasswordComplexity",
    "workProfileRequiredPasswordComplexity":  "low",
    "workProfileRequirePassword":  true,
    "securityRequireVerifyApps":  false,
    "vpnAlwaysOnPackageIdentifier":  null,
    "vpnEnableAlwaysOnLockdownMode":  false,
    "workProfileAllowWidgets":  true,
    "workProfileBlockPersonalAppInstallsFromUnknownSources":  false,
    "workProfileAccountUse@odata.type":  "#microsoft.graph.androidWorkProfileAccountUse",
    "workProfileAccountUse":  "allowAllExceptGoogleAccounts",
    "allowedGoogleAccountDomains@odata.type":  "#Collection(String)",
    "allowedGoogleAccountDomains":  [

                                    ],
    "blockUnifiedPasswordForWorkProfile":  false,
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/assignments",
    "assignments":  [

                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.androidWorkProfileGeneralDeviceConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027fe19c4c8-6dbe-4042-ab97-8afd847b7d2d\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
