{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "id":  "f800335f-4fb5-49e8-a352-3c96821581c5",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-11-01T14:16:30.3775628Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-11-01T14:15:24.7478268Z",
    "description":  "",
    "displayName":  "Android Corporate - GHS - TP - Device Restrictions - D - Applications",
    "version":  2,
    "accountsBlockModification":  null,
    "appsAllowInstallFromUnknownSources":  null,
    "appsAutoUpdatePolicy@odata.type":  "#microsoft.graph.androidDeviceOwnerAppAutoUpdatePolicyType",
    "appsAutoUpdatePolicy":  "always",
    "appsDefaultPermissionPolicy":  null,
    "appsRecommendSkippingFirstUseHints":  null,
    "bluetoothBlockConfiguration":  null,
    "bluetoothBlockContactSharing":  null,
    "cameraBlocked":  null,
    "cellularBlockWiFiTethering":  null,
    "certificateCredentialConfigurationDisabled":  null,
    "crossProfilePoliciesAllowCopyPaste":  null,
    "crossProfilePoliciesAllowDataSharing@odata.type":  "#microsoft.graph.androidDeviceOwnerCrossProfileDataSharing",
    "crossProfilePoliciesAllowDataSharing":  "notConfigured",
    "crossProfilePoliciesShowWorkContactsInPersonalProfile":  null,
    "microsoftLauncherConfigurationEnabled":  null,
    "microsoftLauncherCustomWallpaperEnabled":  null,
    "microsoftLauncherCustomWallpaperImageUrl":  null,
    "microsoftLauncherCustomWallpaperAllowUserModification":  null,
    "microsoftLauncherFeedEnabled":  null,
    "microsoftLauncherFeedAllowUserModification":  null,
    "microsoftLauncherDockPresenceConfiguration":  null,
    "microsoftLauncherDockPresenceAllowUserModification":  null,
    "microsoftLauncherSearchBarPlacementConfiguration":  null,
    "enrollmentProfile@odata.type":  "#microsoft.graph.androidDeviceOwnerEnrollmentProfileType",
    "enrollmentProfile":  "notConfigured",
    "dataRoamingBlocked":  null,
    "dateTimeConfigurationBlocked":  null,
    "detailedHelpText":  null,
    "deviceOwnerLockScreenMessage":  null,
    "securityCommonCriteriaModeEnabled":  null,
    "factoryResetDeviceAdministratorEmails@odata.type":  "#Collection(String)",
    "factoryResetDeviceAdministratorEmails":  [

                                              ],
    "factoryResetBlocked":  null,
    "globalProxy":  null,
    "googleAccountsBlocked":  null,
    "kioskCustomizationDeviceSettingsBlocked":  null,
    "kioskCustomizationPowerButtonActionsBlocked":  null,
    "kioskCustomizationStatusBar@odata.type":  "#microsoft.graph.androidDeviceOwnerKioskCustomizationStatusBar",
    "kioskCustomizationStatusBar":  "notConfigured",
    "kioskCustomizationSystemErrorWarnings":  null,
    "kioskCustomizationSystemNavigation@odata.type":  "#microsoft.graph.androidDeviceOwnerKioskCustomizationSystemNavigation",
    "kioskCustomizationSystemNavigation":  "notConfigured",
    "kioskModeScreenSaverConfigurationEnabled":  null,
    "kioskModeScreenSaverImageUrl":  null,
    "kioskModeScreenSaverDisplayTimeInSeconds":  null,
    "kioskModeScreenSaverStartDelayInSeconds":  null,
    "kioskModeScreenSaverDetectMediaDisabled":  null,
    "kioskModeWallpaperUrl":  null,
    "kioskModeExitCode":  null,
    "kioskModeVirtualHomeButtonEnabled":  null,
    "kioskModeVirtualHomeButtonType":  null,
    "kioskModeBluetoothConfigurationEnabled":  null,
    "kioskModeWiFiConfigurationEnabled":  null,
    "kioskModeFlashlightConfigurationEnabled":  null,
    "kioskModeMediaVolumeConfigurationEnabled":  null,
    "kioskModeShowDeviceInfo":  null,
    "kioskModeManagedSettingsEntryDisabled":  null,
    "kioskModeDebugMenuEasyAccessEnabled":  null,
    "kioskModeShowAppNotificationBadge":  null,
    "kioskModeScreenOrientation":  null,
    "kioskModeIconSize":  null,
    "kioskModeFolderIcon":  null,
    "kioskModeWifiAllowedSsids@odata.type":  "#Collection(String)",
    "kioskModeWifiAllowedSsids":  [

                                  ],
    "kioskModeAppOrderEnabled":  null,
    "kioskModeAppsInFolderOrderedByName":  null,
    "kioskModeGridHeight":  null,
    "kioskModeGridWidth":  null,
    "kioskModeLockHomeScreen":  null,
    "kioskModeManagedHomeScreenAutoSignout":  null,
    "kioskModeManagedHomeScreenInactiveSignOutDelayInSeconds":  null,
    "kioskModeManagedHomeScreenInactiveSignOutNoticeInSeconds":  null,
    "kioskModeManagedHomeScreenPinComplexity":  null,
    "kioskModeManagedHomeScreenPinRequired":  null,
    "kioskModeManagedHomeScreenPinRequiredToResume":  null,
    "kioskModeManagedHomeScreenSignInBackground":  null,
    "kioskModeManagedHomeScreenSignInBrandingLogo":  null,
    "kioskModeManagedHomeScreenSignInEnabled":  null,
    "kioskModeUseManagedHomeScreenApp@odata.type":  "#microsoft.graph.kioskModeType",
    "kioskModeUseManagedHomeScreenApp":  "notConfigured",
    "microphoneForceMute":  null,
    "networkEscapeHatchAllowed":  null,
    "nfcBlockOutgoingBeam":  null,
    "passwordBlockKeyguard":  null,
    "passwordBlockKeyguardFeatures@odata.type":  "#Collection(microsoft.graph.androidKeyguardFeature)",
    "passwordBlockKeyguardFeatures":  [

                                      ],
    "passwordExpirationDays":  null,
    "passwordMinimumLength":  null,
    "passwordMinimumLetterCharacters":  null,
    "passwordMinimumLowerCaseCharacters":  null,
    "passwordMinimumNonLetterCharacters":  null,
    "passwordMinimumNumericCharacters":  null,
    "passwordMinimumSymbolCharacters":  null,
    "passwordMinimumUpperCaseCharacters":  null,
    "passwordMinutesOfInactivityBeforeScreenTimeout":  null,
    "passwordPreviousPasswordCountToBlock":  null,
    "passwordRequiredType@odata.type":  "#microsoft.graph.androidDeviceOwnerRequiredPasswordType",
    "passwordRequiredType":  "deviceDefault",
    "passwordRequireUnlock@odata.type":  "#microsoft.graph.androidDeviceOwnerRequiredPasswordUnlock",
    "passwordRequireUnlock":  "deviceDefault",
    "passwordSignInFailureCountBeforeFactoryReset":  null,
    "playStoreMode":  null,
    "screenCaptureBlocked":  null,
    "securityDeveloperSettingsEnabled":  null,
    "securityRequireVerifyApps":  true,
    "shortHelpText":  null,
    "statusBarBlocked":  null,
    "stayOnModes@odata.type":  "#Collection(microsoft.graph.androidDeviceOwnerBatteryPluggedMode)",
    "stayOnModes":  [

                    ],
    "storageAllowUsb":  null,
    "storageBlockExternalMedia":  null,
    "storageBlockUsbFileTransfer":  null,
    "systemUpdateWindowStartMinutesAfterMidnight":  null,
    "systemUpdateWindowEndMinutesAfterMidnight":  null,
    "systemUpdateInstallType":  null,
    "systemWindowsBlocked":  null,
    "usersBlockAdd":  null,
    "usersBlockRemove":  null,
    "volumeBlockAdjustment":  null,
    "vpnAlwaysOnLockdownMode":  false,
    "vpnAlwaysOnPackageIdentifier":  "",
    "wifiBlockEditConfigurations":  null,
    "wifiBlockEditPolicyDefinedConfigurations":  null,
    "personalProfileAppsAllowInstallFromUnknownSources":  null,
    "personalProfileCameraBlocked":  null,
    "personalProfileScreenCaptureBlocked":  null,
    "personalProfilePlayStoreMode@odata.type":  "#microsoft.graph.personalProfilePersonalPlayStoreMode",
    "personalProfilePlayStoreMode":  "notConfigured",
    "workProfilePasswordExpirationDays":  null,
    "workProfilePasswordMinimumLength":  null,
    "workProfilePasswordMinimumNumericCharacters":  null,
    "workProfilePasswordMinimumNonLetterCharacters":  null,
    "workProfilePasswordMinimumLetterCharacters":  null,
    "workProfilePasswordMinimumLowerCaseCharacters":  null,
    "workProfilePasswordMinimumUpperCaseCharacters":  null,
    "workProfilePasswordMinimumSymbolCharacters":  null,
    "workProfilePasswordPreviousPasswordCountToBlock":  null,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset":  null,
    "workProfilePasswordRequiredType@odata.type":  "#microsoft.graph.androidDeviceOwnerRequiredPasswordType",
    "workProfilePasswordRequiredType":  "deviceDefault",
    "workProfilePasswordRequireUnlock@odata.type":  "#microsoft.graph.androidDeviceOwnerRequiredPasswordUnlock",
    "workProfilePasswordRequireUnlock":  "deviceDefault",
    "locateDeviceUserlessDisabled":  null,
    "locateDeviceLostModeEnabled":  null,
    "shareDeviceLocationDisabled":  null,
    "deviceLocationMode@odata.type":  "#microsoft.graph.androidDeviceOwnerLocationMode",
    "deviceLocationMode":  "notConfigured",
    "azureAdSharedDeviceDataClearApps@odata.type":  "#Collection(microsoft.graph.appListItem)",
    "azureAdSharedDeviceDataClearApps":  [

                                         ],
    "kioskModeApps@odata.type":  "#Collection(microsoft.graph.appListItem)",
    "kioskModeApps":  [

                      ],
    "kioskModeManagedFolders@odata.type":  "#Collection(microsoft.graph.androidDeviceOwnerKioskModeManagedFolder)",
    "kioskModeManagedFolders":  [

                                ],
    "kioskModeAppPositions@odata.type":  "#Collection(microsoft.graph.androidDeviceOwnerKioskModeAppPositionItem)",
    "kioskModeAppPositions":  [

                              ],
    "systemUpdateFreezePeriods@odata.type":  "#Collection(microsoft.graph.androidDeviceOwnerSystemUpdateFreezePeriod)",
    "systemUpdateFreezePeriods":  [

                                  ],
    "personalProfilePersonalApplications@odata.type":  "#Collection(microsoft.graph.appListItem)",
    "personalProfilePersonalApplications":  [

                                            ],
    "androidDeviceOwnerDelegatedScopeAppSettings@odata.type":  "#Collection(microsoft.graph.androidDeviceOwnerDelegatedScopeAppSetting)",
    "androidDeviceOwnerDelegatedScopeAppSettings":  [

                                                    ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments",
    "assignments":  [

                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027f800335f-4fb5-49e8-a352-3c96821581c5\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
