{
    "@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(assignments())/$entity",
    "@odata.type":  "#microsoft.graph.iosGeneralDeviceConfiguration",
    "@odata.id":  "deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)",
    "@odata.editLink":  "deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration",
    "id":  "685c97e4-b9d5-4ae9-8ece-d21ca02bdf67",
    "lastModifiedDateTime@odata.type":  "#DateTimeOffset",
    "lastModifiedDateTime":  "2024-11-01T14:23:49.682714Z",
    "roleScopeTagIds@odata.type":  "#Collection(String)",
    "roleScopeTagIds":  [
                            "0"
                        ],
    "supportsScopeTags":  true,
    "deviceManagementApplicabilityRuleOsEdition":  null,
    "deviceManagementApplicabilityRuleOsVersion":  null,
    "deviceManagementApplicabilityRuleDeviceMode":  null,
    "createdDateTime@odata.type":  "#DateTimeOffset",
    "createdDateTime":  "2024-11-01T14:21:07.6366006Z",
    "description":  "",
    "displayName":  "iOS - GHS - TP - Device Restrictions - D - General",
    "version":  2,
    "accountBlockModification":  false,
    "activationLockAllowWhenSupervised":  false,
    "airDropBlocked":  false,
    "airDropForceUnmanagedDropTarget":  false,
    "airPlayForcePairingPasswordForOutgoingRequests":  false,
    "appleWatchBlockPairing":  false,
    "appleWatchForceWristDetection":  false,
    "appleNewsBlocked":  false,
    "appsVisibilityListType@odata.type":  "#microsoft.graph.appListType",
    "appsVisibilityListType":  "none",
    "appStoreBlockAutomaticDownloads":  false,
    "appStoreBlocked":  false,
    "appStoreBlockInAppPurchases":  false,
    "appStoreBlockUIAppInstallation":  false,
    "appStoreRequirePassword":  false,
    "autoFillForceAuthentication":  false,
    "bluetoothBlockModification":  false,
    "cameraBlocked":  false,
    "cellularBlockDataRoaming":  false,
    "cellularBlockGlobalBackgroundFetchWhileRoaming":  false,
    "cellularBlockPerAppDataModification":  false,
    "cellularBlockPersonalHotspot":  false,
    "cellularBlockPlanModification":  false,
    "cellularBlockVoiceRoaming":  false,
    "certificatesBlockUntrustedTlsCertificates":  false,
    "classroomAppBlockRemoteScreenObservation":  false,
    "classroomAppForceUnpromptedScreenObservation":  false,
    "classroomForceAutomaticallyJoinClasses":  false,
    "classroomForceUnpromptedAppAndDeviceLock":  false,
    "compliantAppListType@odata.type":  "#microsoft.graph.appListType",
    "compliantAppListType":  "none",
    "configurationProfileBlockChanges":  false,
    "definitionLookupBlocked":  false,
    "deviceBlockEnableRestrictions":  false,
    "deviceBlockEraseContentAndSettings":  false,
    "deviceBlockNameModification":  false,
    "diagnosticDataBlockSubmission":  true,
    "diagnosticDataBlockSubmissionModification":  false,
    "documentsBlockManagedDocumentsInUnmanagedApps":  false,
    "documentsBlockUnmanagedDocumentsInManagedApps":  false,
    "emailInDomainSuffixes@odata.type":  "#Collection(String)",
    "emailInDomainSuffixes":  [

                              ],
    "enterpriseAppBlockTrust":  false,
    "enterpriseAppBlockTrustModification":  false,
    "esimBlockModification":  false,
    "faceTimeBlocked":  false,
    "findMyFriendsBlocked":  false,
    "gamingBlockGameCenterFriends":  false,
    "gamingBlockMultiplayer":  false,
    "gameCenterBlocked":  false,
    "hostPairingBlocked":  false,
    "iBooksStoreBlocked":  false,
    "iBooksStoreBlockErotica":  false,
    "iCloudBlockActivityContinuation":  false,
    "iCloudBlockBackup":  false,
    "iCloudBlockDocumentSync":  false,
    "iCloudBlockManagedAppsSync":  false,
    "iCloudBlockPhotoLibrary":  false,
    "iCloudBlockPhotoStreamSync":  false,
    "iCloudBlockSharedPhotoStream":  false,
    "iCloudRequireEncryptedBackup":  false,
    "iTunesBlockExplicitContent":  false,
    "iTunesBlockMusicService":  false,
    "iTunesBlockRadio":  false,
    "keyboardBlockAutoCorrect":  false,
    "keyboardBlockDictation":  false,
    "keyboardBlockPredictive":  false,
    "keyboardBlockShortcuts":  false,
    "keyboardBlockSpellCheck":  false,
    "kioskModeAllowAssistiveSpeak":  false,
    "kioskModeAllowAssistiveTouchSettings":  false,
    "kioskModeAllowAutoLock":  false,
    "kioskModeBlockAutoLock":  false,
    "kioskModeAllowColorInversionSettings":  false,
    "kioskModeAllowRingerSwitch":  false,
    "kioskModeBlockRingerSwitch":  false,
    "kioskModeAllowScreenRotation":  false,
    "kioskModeBlockScreenRotation":  false,
    "kioskModeAllowSleepButton":  false,
    "kioskModeBlockSleepButton":  false,
    "kioskModeAllowTouchscreen":  false,
    "kioskModeBlockTouchscreen":  false,
    "kioskModeEnableVoiceControl":  false,
    "kioskModeAllowVoiceControlModification":  false,
    "kioskModeAllowVoiceOverSettings":  false,
    "kioskModeAllowVolumeButtons":  false,
    "kioskModeBlockVolumeButtons":  false,
    "kioskModeAllowZoomSettings":  false,
    "kioskModeAppStoreUrl":  null,
    "kioskModeBuiltInAppId":  null,
    "kioskModeRequireAssistiveTouch":  false,
    "kioskModeRequireColorInversion":  false,
    "kioskModeRequireMonoAudio":  false,
    "kioskModeRequireVoiceOver":  false,
    "kioskModeRequireZoom":  false,
    "kioskModeManagedAppId":  null,
    "lockScreenBlockControlCenter":  false,
    "lockScreenBlockNotificationView":  false,
    "lockScreenBlockPassbook":  false,
    "lockScreenBlockTodayView":  false,
    "mediaContentRatingAustralia":  null,
    "mediaContentRatingCanada":  null,
    "mediaContentRatingFrance":  null,
    "mediaContentRatingGermany":  null,
    "mediaContentRatingIreland":  null,
    "mediaContentRatingJapan":  null,
    "mediaContentRatingNewZealand":  null,
    "mediaContentRatingUnitedKingdom":  null,
    "mediaContentRatingUnitedStates":  null,
    "mediaContentRatingApps@odata.type":  "#microsoft.graph.ratingAppsType",
    "mediaContentRatingApps":  "allAllowed",
    "messagesBlocked":  false,
    "notificationsBlockSettingsModification":  false,
    "passcodeBlockFingerprintUnlock":  false,
    "passcodeBlockFingerprintModification":  false,
    "passcodeBlockModification":  false,
    "passcodeBlockSimple":  false,
    "passcodeExpirationDays":  null,
    "passcodeMinimumLength":  null,
    "passcodeMinutesOfInactivityBeforeLock":  null,
    "passcodeMinutesOfInactivityBeforeScreenTimeout":  null,
    "passcodeMinimumCharacterSetCount":  null,
    "passcodePreviousPasscodeBlockCount":  null,
    "passcodeSignInFailureCountBeforeWipe":  null,
    "passcodeRequiredType@odata.type":  "#microsoft.graph.requiredPasswordType",
    "passcodeRequiredType":  "deviceDefault",
    "passcodeRequired":  false,
    "podcastsBlocked":  false,
    "proximityBlockSetupToNewDevice":  false,
    "safariBlockAutofill":  false,
    "safariBlockJavaScript":  false,
    "safariBlockPopups":  false,
    "safariBlocked":  false,
    "safariCookieSettings@odata.type":  "#microsoft.graph.webBrowserCookieSettings",
    "safariCookieSettings":  "browserDefault",
    "safariManagedDomains@odata.type":  "#Collection(String)",
    "safariManagedDomains":  [

                             ],
    "safariPasswordAutoFillDomains@odata.type":  "#Collection(String)",
    "safariPasswordAutoFillDomains":  [

                                      ],
    "safariRequireFraudWarning":  false,
    "screenCaptureBlocked":  false,
    "siriBlocked":  false,
    "siriBlockedWhenLocked":  false,
    "siriBlockUserGeneratedContent":  false,
    "siriRequireProfanityFilter":  false,
    "softwareUpdatesEnforcedDelayInDays":  null,
    "softwareUpdatesForceDelayed":  false,
    "spotlightBlockInternetResults":  false,
    "voiceDialingBlocked":  false,
    "wallpaperBlockModification":  false,
    "wiFiConnectOnlyToConfiguredNetworks":  false,
    "classroomForceRequestPermissionToLeaveClasses":  false,
    "keychainBlockCloudSync":  false,
    "pkiBlockOTAUpdates":  false,
    "privacyForceLimitAdTracking":  true,
    "enterpriseBookBlockBackup":  false,
    "enterpriseBookBlockMetadataSync":  false,
    "airPrintBlocked":  false,
    "airPrintBlockCredentialsStorage":  false,
    "airPrintForceTrustedTLS":  false,
    "airPrintBlockiBeaconDiscovery":  false,
    "filesNetworkDriveAccessBlocked":  false,
    "filesUsbDriveAccessBlocked":  false,
    "wifiPowerOnForced":  false,
    "blockSystemAppRemoval":  false,
    "vpnBlockCreation":  false,
    "appRemovalBlocked":  false,
    "usbRestrictedModeBlocked":  false,
    "passwordBlockAutoFill":  false,
    "passwordBlockProximityRequests":  false,
    "passwordBlockAirDropSharing":  false,
    "dateAndTimeForceSetAutomatically":  false,
    "contactsAllowManagedToUnmanagedWrite":  false,
    "contactsAllowUnmanagedToManagedRead":  false,
    "cellularBlockPersonalHotspotModification":  false,
    "continuousPathKeyboardBlocked":  false,
    "findMyDeviceInFindMyAppBlocked":  false,
    "findMyFriendsInFindMyAppBlocked":  false,
    "iTunesBlocked":  false,
    "sharedDeviceBlockTemporarySessions":  false,
    "appClipsBlocked":  false,
    "applePersonalizedAdsBlocked":  true,
    "nfcBlocked":  false,
    "autoUnlockBlocked":  false,
    "unpairedExternalBootToRecoveryAllowed":  false,
    "onDeviceOnlyDictationForced":  false,
    "wiFiConnectToAllowedNetworksOnlyForced":  false,
    "onDeviceOnlyTranslationForced":  false,
    "managedPasteboardRequired":  false,
    "iCloudPrivateRelayBlocked":  false,
    "kioskModeAppType@odata.type":  "#microsoft.graph.iosKioskModeAppType",
    "kioskModeAppType":  "notConfigured",
    "appsSingleAppModeList@odata.type":  "#Collection(microsoft.graph.appListItem)",
    "appsSingleAppModeList":  [

                              ],
    "appsVisibilityList@odata.type":  "#Collection(microsoft.graph.appListItem)",
    "appsVisibilityList":  [

                           ],
    "compliantAppsList@odata.type":  "#Collection(microsoft.graph.appListItem)",
    "compliantAppsList":  [

                          ],
    "networkUsageRules@odata.type":  "#Collection(microsoft.graph.iosNetworkUsageRule)",
    "networkUsageRules":  [

                          ],
    "assignments@odata.context":  "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/assignments",
    "assignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/assignments/$ref",
    "assignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/assignments",
    "assignments":  [

                    ],
    "deviceSettingStateSummaries@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/deviceSettingStateSummaries/$ref",
    "deviceSettingStateSummaries@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/deviceSettingStateSummaries",
    "deviceStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/deviceStatuses/$ref",
    "deviceStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/deviceStatuses",
    "deviceStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/deviceStatusOverview/$ref",
    "deviceStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/deviceStatusOverview",
    "groupAssignments@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/groupAssignments/$ref",
    "groupAssignments@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/groupAssignments",
    "userStatuses@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/userStatuses/$ref",
    "userStatuses@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/userStatuses",
    "userStatusOverview@odata.associationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/userStatusOverview/$ref",
    "userStatusOverview@odata.navigationLink":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.iosGeneralDeviceConfiguration/userStatusOverview",
    "#microsoft.graph.assign":  {
                                    "title":  "microsoft.graph.assign",
                                    "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assign"
                                },
    "#microsoft.graph.assignedAccessMultiModeProfiles":  {
                                                             "title":  "microsoft.graph.assignedAccessMultiModeProfiles",
                                                             "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.assignedAccessMultiModeProfiles"
                                                         },
    "#microsoft.graph.windowsPrivacyAccessControls":  {
                                                          "title":  "microsoft.graph.windowsPrivacyAccessControls",
                                                          "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.windowsPrivacyAccessControls"
                                                      },
    "#microsoft.graph.getOmaSettingPlainTextValue":  {
                                                         "title":  "microsoft.graph.getOmaSettingPlainTextValue",
                                                         "target":  "https://graph.microsoft.com/beta/deviceManagement/deviceConfigurations(\u0027685c97e4-b9d5-4ae9-8ece-d21ca02bdf67\u0027)/microsoft.graph.deviceConfiguration/microsoft.graph.getOmaSettingPlainTextValue"
                                                     }
}
